#+BEGIN_SRC elisp
(+ 1 5)
#+END_SRC

#+BEGIN_SRC restclient
GET https://wikipedia.org
#+END_SRC

#+BEGIN_SRC python
  def suma():
      return 5 + 4
   
  return suma()
#+END_SRC

#+BEGIN_SRC ruby
5
#+END_SRC

#+NAME: listado
#+BEGIN_SRC sh :results list :post column1(data=*this*)
ls
#+END_SRC

#+RESULTS: listado
- bashrc
- gnus.org
- notas-Common-Lisp.lisp
- notas.org
- org-mode.org
- pedro-post-install.sh
- programming_in_elisp
- README.md
- scripts-test.org
- site-concider
- the-little-schemer
- tuntap-test

#+NAME: column1
#+BEGIN_SRC elisp
(mapcar 'car data)
#+END_SRC

#+BEGIN_SRC sh :var ZIP=listado[0,0]
echo $ZIP
#+END_SRC

#+RESULTS:
: bashrc

